app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      #binding.pry
      if !@songs = Artist.find(params[:artist_id]).songs rescue nil
        flash[:error] = "Artist not found"
        redirect_to artists_path
      else
        @songs = Artist.find(params[:artist_id]).songs
      end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]
SELECT "songs".* FROM "songs"

  def show
    #binding.pry
    if !@song = Song.find(params[:id]) rescue nil
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]